MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0L1073CFJ/mcu.h
typedef struct                         /*!< (@ 0x400A0200) R_PFS Structure                                            */
{
    __IOM R_PFS_PORT_Type PORT[10];    /*!< (@ 0x00000000) Port [0..9]                                                */
} R_PFS_Type;                          /*!< Size = 320 (0x140)                                                        */

/* =========================================================================================================================== */
/* ================                                          R_PMISC                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief I/O Ports-MISC (R_PMISC)
 */

typedef struct                         /*!< (@ 0x400A0340) R_PMISC Structure                                          */
{
    union
    {
        __IOM uint8_t PWPR;            /*!< (@ 0x00000000) Write-Protect Register                                     */

        struct
        {
            uint8_t             : 6;
            __IOM uint8_t PFSWE : 1;   /*!< [6..6] PmnPFS Register Write                                              */
            __IOM uint8_t B0WI  : 1;   /*!< [7..7] PFSWE Bit Write Disable                                            */
        } PWPR_b;
    };
} R_PMISC_Type;                        /*!< Size = 1 (0x1)                                                            */

/* =========================================================================================================================== */
/* ================                                          R_SAU0                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Serial Array Unit 0 (R_SAU0)
 */

typedef struct                         /*!< (@ 0x400A2000) R_SAU0 Structure                                           */
{
    union
    {
        __IOM uint16_t SDR[4];         /*!< (@ 0x00000000) Serial Data Register                                       */

        struct
        {
            __IOM uint16_t DAT   : 9;  /*!< [8..0] Data Buffer for Transmit and Receive                               */
            __IOM uint16_t STCLK : 7;  /*!< [15..9] Transfer Clock Setting by Dividing the Operation Clock            */
        } SDR_b[4];
    };
    __IM uint16_t RESERVED[124];

    union
    {
        __IM uint16_t SSR[4];          /*!< (@ 0x00000100) Serial Status Register                                     */

        struct
        {
            __IM uint16_t OVF : 1;     /*!< [0..0] Overrun Error Detection Flag                                       */
            __IM uint16_t PEF : 1;     /*!< [1..1] Parity or ACK Error Detection Flag                                 */
            __IM uint16_t FEF : 1;     /*!< [2..2] Framing Error Detection Flag                                       */
            uint16_t          : 2;
            __IM uint16_t BFF : 1;     /*!< [5..5] Flag Indicating the State of the Buffer Register                   */
            __IM uint16_t TSF : 1;     /*!< [6..6] Flag Indicating the State of Communications                        */
            uint16_t          : 9;
        } SSR_b[4];
    };

    union
    {
        __IOM uint16_t SIR[4];         /*!< (@ 0x00000108) Serial Flag Clear Trigger Register                         */

        struct
        {
            __IOM uint16_t OVCT : 1;   /*!< [0..0] Clear Trigger of Overrun Error Flag                                */
            __IOM uint16_t PECT : 1;   /*!< [1..1] Clear Trigger of Parity Error Flag                                 */
            __IOM uint16_t FECT : 1;   /*!< [2..2] Clear Trigger of Framing Error Flag                                */
            uint16_t            : 13;
        } SIR_b[4];
    };

    union
    {
        __IOM uint16_t SMR[4];         /*!< (@ 0x00000110) Serial Mode Register                                       */

        struct
        {
            __IOM uint16_t MD0  : 1;   /*!< [0..0] Interrupt Source                                                   */
            __IOM uint16_t MD1  : 2;   /*!< [2..1] Operation Mode                                                     */
            uint16_t            : 3;
            __IOM uint16_t SIS0 : 1;   /*!< [6..6] Inversion of Level Receive Data in UART Mode                       */
            uint16_t            : 1;
            __IOM uint16_t STS  : 1;   /*!< [8..8] Start Trigger Source                                               */
            uint16_t            : 5;
            __IOM uint16_t CCS  : 1;   /*!< [14..14] Transfer Clock (fTCLK)                                           */
            __IOM uint16_t CKS  : 1;   /*!< [15..15] Operation Clock (fMCK)                                           */
        } SMR_b[4];
    };

    union
    {
        __IOM uint16_t SCR[4];         /*!< (@ 0x00000118) Serial Communication Operation Setting Register            */

        struct
        {
            __IOM uint16_t DLS : 2;    /*!< [1..0] Data Length in Simplified SPI and UART Modes                       */
            uint16_t           : 2;
            __IOM uint16_t SLC : 2;    /*!< [5..4] Stop Bit in UART Mode                                              */
            uint16_t           : 1;
            __IOM uint16_t DIR : 1;    /*!< [7..7] Data Transfer Sequence in Simplified SPI and UART Modes            */
            __IOM uint16_t PTC : 2;    /*!< [9..8] Parity Bit in UART Mode                                            */
            __IOM uint16_t EOC : 1;    /*!< [10..10] Mask Control of Error Interrupt Signal SAU0_UART_ERRI0
                                        *   (m = 0), SAU1_UART_ERRI2 (m = 1)                                          */
            uint16_t            : 1;
            __IOM uint16_t DCP  : 2;   /*!< [13..12] Data and Clock Phase in Simplified SPI Mode                      */
            __IOM uint16_t TRXE : 2;   /*!< [15..14] Channel Operation Mode                                           */
        } SCR_b[4];
    };

    union
    {
        __IM uint16_t SE;              /*!< (@ 0x00000120) Serial Channel Enable Status                               */

        struct
        {
            __IM uint16_t SE : 4;      /*!< [3..0] Indication of whether Operation is Enabled or Stopped.             */
            uint16_t         : 12;
        } SE_b;
    };

    union
    {
        __IOM uint16_t SS;             /*!< (@ 0x00000122) Serial Channel Start Register                              */

        struct
        {
            __IOM uint16_t SS : 4;     /*!< [3..0] Operation Start Trigger                                            */
            uint16_t          : 12;
        } SS_b;
    };

    union
    {
        __IOM uint16_t ST;             /*!< (@ 0x00000124) Serial Channel Stop Register                               */

        struct
        {
            __IOM uint16_t ST : 4;     /*!< [3..0] Operation Stop Trigger                                             */
            uint16_t          : 12;
        } ST_b;
    };

    union
    {
        __IOM uint16_t SPS;            /*!< (@ 0x00000126) Serial Clock Select Register                               */

        struct
        {
            __IOM uint16_t PRS0 : 4;   /*!< [3..0] Operation Clock (CK0)                                              */
            __IOM uint16_t PRS1 : 4;   /*!< [7..4] Selection of Operation Clock (CK1)                                 */
            uint16_t            : 8;
        } SPS_b;
    };

    union
    {
        __IOM uint16_t SO;             /*!< (@ 0x00000128) Serial Output Register                                     */

        struct
        {
            __IOM uint16_t SO  : 4;    /*!< [3..0] Serial Data Output                                                 */
            uint16_t           : 4;
            __IOM uint16_t CKO : 4;    /*!< [11..8] Serial Clock Output                                               */
            uint16_t           : 4;
        } SO_b;
    };

    union
    {
        __IOM uint16_t SOE;            /*!< (@ 0x0000012A) Serial Output Enable Register                              */

        struct
        {
            __IOM uint16_t SOE : 4;    /*!< [3..0] Serial Output Enable or Stop                                       */
            uint16_t           : 12;
        } SOE_b;
    };
    __IM uint16_t RESERVED1[4];

    union
    {
        __IOM uint16_t SOL;            /*!< (@ 0x00000134) Serial Output Level Register                               */

        struct
        {
            __IOM uint16_t SOL0 : 1;   /*!< [0..0] Inverts the transmit signal in UART Mode                           */
            uint16_t            : 1;
            __IOM uint16_t SOL2 : 1;   /*!< [2..2] Inverts the transmit signal in UART Mode                           */
            uint16_t            : 13;
        } SOL_b;
    };
    __IM uint16_t RESERVED2;

    union
    {
        __IOM uint16_t SSC;            /*!< (@ 0x00000138) Serial Standby Control Register                            */

        struct
        {
            __IOM uint16_t SWC  : 1;   /*!< [0..0] Snooze Mode                                                        */
            __IOM uint16_t SSEC : 1;   /*!< [1..1] Generation of Communication Error Interrupts in Snooze
                                        *   Mode                                                                      */
            uint16_t : 14;
        } SSC_b;
    };
} R_SAU0_Type;                         /*!< Size = 314 (0x13a)                                                        */

/* =========================================================================================================================== */
/* ================                                          R_SRAM                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief SRAM (R_SRAM)
 */

typedef struct                         /*!< (@ 0x40002000) R_SRAM Structure                                           */
{
    union
    {
        __IOM uint8_t PARIOAD;         /*!< (@ 0x00000000) SRAM Parity Error Operation After Detection Register       */

        struct
        {
            __IOM uint8_t OAD : 1;     /*!< [0..0] Operation after Detection                                          */
            uint8_t           : 7;
        } PARIOAD_b;
    };
    __IM uint8_t RESERVED[3];

    union
    {
        __IOM uint8_t SRAMPRCR;         /*!< (@ 0x00000004) SRAM Protection Register                                   */

        struct
        {
            __IOM uint8_t SRAMPRCR : 1; /*!< [0..0] Register Write Control                                             */
            __OM uint8_t  KW       : 7; /*!< [7..1] Write Key Code                                                     */
        } SRAMPRCR_b;
    };
    __IM uint8_t  RESERVED1[3];
    __IOM uint8_t SRAMWTSC;             /*!< (@ 0x00000008) RAM Wait State Control Register                            */
    __IM uint8_t  RESERVED2[3];

    union
    {
        __IOM uint8_t SRAMPRCR2;         /*!< (@ 0x0000000C) SRAM Protection Register 2                                 */

        struct
        {
            __IOM uint8_t SRAMPRCR2 : 1; /*!< [0..0] Register Write Control                                             */
            __OM uint8_t  KW        : 7; /*!< [7..1] Write Key Code                                                     */
        } SRAMPRCR2_b;
    };
    __IM uint8_t RESERVED3[179];

    union
    {
        __IOM uint8_t ECCMODE;         /*!< (@ 0x000000C0) ECC Operating Mode Control Register                        */

        struct
        {
            __IOM uint8_t ECCMOD : 2;  /*!< [1..0] ECC Operating Mode Select                                          */
            uint8_t              : 6;
        } ECCMODE_b;
    };

    union
    {
        __IOM uint8_t ECC2STS;         /*!< (@ 0x000000C1) ECC 2-Bit Error Status Register                            */

        struct
        {
            __IOM uint8_t ECC2ERR : 1; /*!< [0..0] ECC 2-Bit Error Status                                             */
            uint8_t               : 7;
        } ECC2STS_b;
    };

    union
    {
        __IOM uint8_t ECC1STSEN;       /*!< (@ 0x000000C2) ECC 1-Bit Error Information Update Enable Register         */

        struct
        {
            __IOM uint8_t E1STSEN : 1; /*!< [0..0] ECC 1-Bit Error Information Update Enable                          */
            uint8_t               : 7;
        } ECC1STSEN_b;
    };

    union
    {
        __IOM uint8_t ECC1STS;         /*!< (@ 0x000000C3) ECC 1-Bit Error Status Register                            */

        struct
        {
            __IOM uint8_t ECC1ERR : 1; /*!< [0..0] ECC 1-Bit Error Status                                             */
            uint8_t               : 7;
        } ECC1STS_b;
    };

    union
    {
        __IOM uint8_t ECCPRCR;         /*!< (@ 0x000000C4) ECC Protection Register                                    */

        struct
        {
            __IOM uint8_t ECCPRCR : 1; /*!< [0..0] Register Write Control                                             */
            __OM uint8_t  KW      : 7; /*!< [7..1] Write Key Code                                                     */
        } ECCPRCR_b;
    };
    __IM uint8_t RESERVED4[11];

    union
    {
        __IOM uint8_t ECCPRCR2;         /*!< (@ 0x000000D0) ECC Protection Register 2                                  */

        struct
        {
            __IOM uint8_t ECCPRCR2 : 1; /*!< [0..0] Register Write Control                                             */
            __OM uint8_t  KW2      : 7; /*!< [7..1] Write Key Code                                                     */
        } ECCPRCR2_b;
    };
    __IM uint8_t RESERVED5[3];

    union
    {
        __IOM uint8_t ECCETST;         /*!< (@ 0x000000D4) ECC Test Control Register                                  */

        struct
        {
            __IOM uint8_t TSTBYP : 1;  /*!< [0..0] ECC Bypass Select                                                  */
            uint8_t              : 7;
        } ECCETST_b;
    };
    __IM uint8_t RESERVED6[3];

    union
    {
        __IOM uint8_t ECCOAD;          /*!< (@ 0x000000D8) SRAM ECC Error Operation After Detection Register          */

        struct
        {
            __IOM uint8_t OAD : 1;     /*!< [0..0] Operation after Detection                                          */
            uint8_t           : 7;
        } ECCOAD_b;
    };
} R_SRAM_Type;                         /*!< Size = 217 (0xd9)                                                         */

/* =========================================================================================================================== */
/* ================                                         R_SYSTEM                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief System Control (R_SYSTEM)
 */

typedef struct                         /*!< (@ 0x4001E000) R_SYSTEM Structure                                         */
{
    __IM uint16_t RESERVED[1024];

    union
    {
        __IOM uint8_t CMC;             /*!< (@ 0x00000800) Clock Operation Mode Control Register                      */

        struct
        {
            __IOM uint8_t MODRV : 1;   /*!< [0..0] Main Clock Oscillator Drive Capability Switching                   */
            __IOM uint8_t SODRV : 2;   /*!< [2..1] Sub-Clock Oscillator Drive Capability Switching                    */
            __IOM uint8_t XTSEL : 1;   /*!< [3..3] Selecting Clock Oscillator                                         */
            __IOM uint8_t SOSEL : 1;   /*!< [4..4] Sub Clock Oscillator Switching                                     */
            uint8_t             : 1;
            __IOM uint8_t MOSEL : 2;   /*!< [7..6] Main Clock Oscillator Switching                                    */
        } CMC_b;
    };
    __IM uint8_t RESERVED1[2];

    union
    {
        __IOM uint8_t SOMRG;           /*!< (@ 0x00000803) Sub-clock Oscillator Margin Check Register                 */

        struct
        {
            __IOM uint8_t SOSCMRG : 2; /*!< [1..0] Sub Clock Oscillator Margin Check Switching                        */
            uint8_t               : 6;
        } SOMRG_b;
    };

    union
    {
        __IOM uint8_t MIOTRM;          /*!< (@ 0x00000804) Middle-speed On-chip Oscillator Trimming Register          */

        struct
        {
            __IOM uint8_t MIOTRM : 8;  /*!< [7..0] MOCO User Trimming                                                 */
        } MIOTRM_b;
    };

    union
    {
        __IOM uint8_t LIOTRM;          /*!< (@ 0x00000805) Low-speed On-chip Oscillator Trimming Register             */

        struct
        {
            __IOM uint8_t LIOTRM : 8;  /*!< [7..0] LOCO User Trimming                                                 */
        } LIOTRM_b;
    };
    __IM uint16_t RESERVED2;

    union
    {
        __IOM uint8_t HOCOCR;          /*!< (@ 0x00000808) High-speed On-chip Oscillator Control Register             */

        struct
        {
            __IOM uint8_t HCSTP : 1;   /*!< [0..0] HOCO Stop                                                          */
            uint8_t             : 7;
        } HOCOCR_b;
    };

    union
    {
        __IOM uint8_t MOCOCR;          /*!< (@ 0x00000809) Middle-speed On-chip Oscillator Control Register           */

        struct
        {
            __IOM uint8_t MCSTP : 1;   /*!< [0..0] MOCO Stop                                                          */
            uint8_t             : 7;
        } MOCOCR_b;
    };

    union
    {
        __IOM uint8_t LOCOCR;          /*!< (@ 0x0000080A) Low-speed On-chip Oscillator Control Register              */

        struct
        {
            __IOM uint8_t LCSTP : 1;   /*!< [0..0] LOCO Stop                                                          */
            uint8_t             : 7;
        } LOCOCR_b;
    };

    union
    {
        __IOM uint8_t MOSCCR;          /*!< (@ 0x0000080B) Main Clock Oscillator Control Register                     */

        struct
        {
            __IOM uint8_t MOSTP : 1;   /*!< [0..0] Main Clock Oscillator Stop                                         */
            uint8_t             : 7;
        } MOSCCR_b;
    };

    union
    {
        __IOM uint8_t SOSCCR;          /*!< (@ 0x0000080C) Sub-clock Oscillator Control Register                      */

        struct
        {
            __IOM uint8_t SOSTP : 1;   /*!< [0..0] Sub Clock Oscillator Stop                                          */
            uint8_t             : 7;
        } SOSCCR_b;
    };
    __IM uint8_t  RESERVED3;
    __IM uint16_t RESERVED4;

    union
    {
        __IM uint8_t OSTC;             /*!< (@ 0x00000810) Oscillation Stabilization Time Counter Status
                                        *                  Register                                                   */

        struct
        {
            __IM uint8_t MOST : 8;     /*!< [7..0] Selection of the Oscillation Stabilization Time                    */
        } OSTC_b;
    };

    union
    {
        __IOM uint8_t OSTS;            /*!< (@ 0x00000811) Oscillation Stabilization Time Select Register             */

        struct
        {
            __IOM uint8_t OSTSB : 3;   /*!< [2..0] Selection of the Oscillation Stabilization Time                    */
            uint8_t             : 5;
        } OSTS_b;
    };

    union
    {
        __IM uint8_t OSCSF;            /*!< (@ 0x00000812) Oscillation Stabilization Flag Register                    */

        struct
        {
            __IM uint8_t HOCOSF : 1;   /*!< [0..0] HOCO Clock Oscillation Stabilization Flag                          */
            uint8_t             : 7;
        } OSCSF_b;
    };
    __IM uint8_t  RESERVED5;
    __IM uint16_t RESERVED6[2];

    union
    {
        __IOM uint8_t HOCODIV;         /*!< (@ 0x00000818) High-speed On-chip Oscillator Frequency Select
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t DIV : 3;     /*!< [2..0] High-speed On-chip Oscillator Clock Division Ratio                 */
            uint8_t           : 5;
        } HOCODIV_b;
    };

    union
    {
        __IOM uint8_t MOCODIV;         /*!< (@ 0x00000819) Middle-speed On-chip Oscillator Frequency Select
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t DIV : 2;     /*!< [1..0] Selection of the Middle-speed On-chip Oscillator Clock
                                        *   Frequency                                                                 */
            uint8_t : 6;
        } MOCODIV_b;
    };

    union
    {
        __IOM uint8_t MOSCDIV;         /*!< (@ 0x0000081A) Main System Clock Division Register                        */

        struct
        {
            __IOM uint8_t DIV : 3;     /*!< [2..0] Selection Division Ratio for the Main System Clock                 */
            uint8_t           : 5;
        } MOSCDIV_b;
    };
    __IM uint8_t  RESERVED7;
    __IM uint16_t RESERVED8[2];

    union
    {
        __IOM uint8_t FOCOSCR;         /*!< (@ 0x00000820) FOCO Clock Source Control Register                         */

        struct
        {
            __IOM uint8_t CKSEL : 1;   /*!< [0..0] FOCO Clock Source Select                                           */
            __IM uint8_t  CKST  : 1;   /*!< [1..1] FOCO Clock Source Status                                           */
            uint8_t             : 6;
        } FOCOSCR_b;
    };

    union
    {
        __IOM uint8_t FMAINSCR;        /*!< (@ 0x00000821) FMAIN Clock Source Control Register                        */

        struct
        {
            __IOM uint8_t CKSEL : 1;   /*!< [0..0] FMAIN Clock Source Select                                          */
            __IM uint8_t  CKST  : 1;   /*!< [1..1] FMAIN Clock Source Status                                          */
            uint8_t             : 6;
        } FMAINSCR_b;
    };

    union
    {
        __IOM uint8_t FSUBSCR;         /*!< (@ 0x00000822) FSUB Clock Source Control Register                         */

        struct
        {
            __IOM uint8_t CKSEL : 1;   /*!< [0..0] FSUB Clock Source Select                                           */
            uint8_t             : 7;
        } FSUBSCR_b;
    };

    union
    {
        __IOM uint8_t ICLKSCR;         /*!< (@ 0x00000823) ICLK Clock Source Control Register                         */

        struct
        {
            __IOM uint8_t CKSEL : 1;   /*!< [0..0] ICLK Clock Source Select                                           */
            __IM uint8_t  CKST  : 1;   /*!< [1..1] ICLK Clock Source Status                                           */
            uint8_t             : 6;
        } ICLKSCR_b;
    };

    union
    {
        __IOM uint8_t OSMC;            /*!< (@ 0x00000824) Subsystem Clock Supply Mode Control Register               */

